app/views/projects/index.html.erb

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 1]]
---
				<td><%= link_to project.title, project_path(project.id),:class => 'btn btn-default' %>
						(<%= project.tasks.count%>)</td>