app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "タイトル３"], ["created_at", "2015-06-06 09:03:16.777115"], ["updated_at", "2015-06-06 09:03:16.777115"]]
---
	def create
		@project = Project.new(project_params)
		if @project.save

UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "タイトル１"], ["updated_at", "2015-06-07 04:51:32.374068"], ["id", 1]]
---
	def update
		if @project.update(project_params)