app/controllers/tasks_controller.rb

  def create
		@project = Project.find(params[:project_id])
    @task = @project.tasks.create(task_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "tasks" ("title", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "あれをやる"], ["project_id", 1], ["created_at", "2015-06-07 05:46:25.649143"], ["updated_at", "2015-06-07 05:46:25.649143"]]

  def toggle
    render nothing: true
    @task = Task.find(params[:id])
    @task.done = !@task.done
    @task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "tasks" SET "done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["done", "t"], ["updated_at", "2015-06-07 07:20:40.095238"], ["id", 2]]